backend/app/controllers/movies_controller.rb

    def index
        movies = Movie.all
---
SELECT "movies".* FROM "movies"

    def show
        movie = Movie.find(id: params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

    def create
        movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("name", "average_rating", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
        movie = Movie.find(params[:id])
        movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "average_rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["average_rating", 1], ["updated_at", "2020-07-31 18:15:40.865788"], ["id", 1]]