backend/app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        review = Review.find(id: params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "likes" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["likes", 18], ["updated_at", "2020-07-30 14:39:39.278203"], ["id", 1]]
---
    def update
        review = Review.find(params[:id])
        review.update(review_params)

INSERT INTO "reviews" ("username", "comment", "rating", "likes", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        review = Review.create(review_params)